class MorseCode {
  // قاموس لتحويل الرموز المورس إلى نص
  static Map<String, String> _morseToText = {
    '.-': 'A',
    '-...': 'B',
    '-.-.': 'C',
    '-..': 'D',
    '.': 'E',
    '..-.': 'F',
    '--.': 'G',
    '....': 'H',
    '..': 'I',
    '.---': 'J',
    '-.-': 'K',
    '.-..': 'L',
    '--': 'M',
    '-.': 'N',
    '---': 'O',
    '.--.': 'P',
    '--.-': 'Q',
    '.-.': 'R',
    '...': 'S',
    '-': 'T',
    '..-': 'U',
    '...-': 'V',
    '.--': 'W',
    '-..-': 'X',
    '-.--': 'Y',
    '--..': 'Z',
    '-----': '0',
    '.----': '1',
    '..---': '2',
    '...--': '3',
    '....-': '4',
    '.....': '5',
    '-....': '6',
    '--...': '7',
    '---..': '8',
    '----.': '9',
    '.-.-.-': '.',
    '--..--': ',',
    '..--..': '?',
    '.----.': "'",
    '-.-.--': '!',
    '-..-.': '/',
    '-.--.': '(',
    '-.--.-': ')',
    '.-...': '&',
    '---...': ':',
    '-.-.-.': ';',
    '-...-': '=',
    '.-.-.': '+',
    '-....-': '-',
    '..--.-': '_',
    '.-..-.': '"',
    '...-..-': '$',
    '.--.-.': '@',
    '': ' ' // مسافة
  };

  // قاموس لتحويل النص إلى رموز مورس
  static Map<String, String> _textToMorse = _morseToText.map((k, v) => MapEntry(v, k));

  // تحويل النص إلى رموز مورس
  static String textToMorse(String text) {
    return text
        .toUpperCase() // تحويل النص إلى حروف كبيرة
        .split('') // تقسيم النص إلى حروف فردية
        .map((char) => _textToMorse[char] ?? '') // تحويل كل حرف إلى رمز مورس
        .join(' '); // الانضمام إلى سلسلة واحدة بفاصلة بين الرموز
  }

  // تحويل رموز مورس إلى نص
  static String morseToText(String morse) {
    return morse
        .split(' ') // تقسيم الرموز المورس إلى قطع فردية
        .map((code) => _morseToText[code] ?? '') // تحويل كل رمز مورس إلى حرف
        .join(''); // الانضمام إلى سلسلة واحدة
  }
}

void main() {
  // النص الذي نريد تحويله إلى رموز مورس والعكس
  String text = "HELLO WORLD";
  
  // تحويل النص إلى رموز مورس
  String morse = MorseCode.textToMorse(text);
  print("Text to Morse: $morse");

  // تحويل رموز مورس إلى نص
  String convertedText = MorseCode.morseToText(morse);
  print("Morse to Text: $convertedText");
}
